In [3]:
import pandas as pd
import sqlite3

db_path = "bank_data.db"
conn = sqlite3.connect(db_path)
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)
# print("Tables in the database:\n", tables)
table_name = tables.iloc[0, 0]
df = pd.read_sql_query(f"SELECT * FROM {table_name};", conn)

In [4]:
df

,id,account_holder,email,contact_number,aadhar_number,pancard,pincode,balance,age
0,1,ANJALI,anjalisisodiya123@gmail.com,7424988062,810824242241,PWLQAE,1254,17800,19

In [6]:
tables

              name
0         accounts
1  sqlite_sequence
2       rd_schemes
3       fd_schemes

In [9]:
table_name

'accounts'